Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВыявленныеДефекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79fbf4a8-8f51-4cef-917b-3e00059df530">
    <name>гкс_Влияние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e4aede75-6f77-4f7d-9149-2cd4d20b2f34">
    <name>гкс_ДефектОформленПоТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7c71a5eb-8ff5-48ba-99f5-fb9859401460">
    <name>гкс_НомерТАГ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2fadb04b-3aaa-4dd8-b305-d053aced95ae">
    <name>гкс_СрочностьВоздействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5d0d56b-7671-492d-a748-7b755db0a10d">
    <name>гкс_КачественнаяОценка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID_Ремонта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="0e256218-3632-4e2f-81f1-fbae93c7e394">
    <name>гкс_ФайлыФиксации</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_Ремонты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГарантийныйРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="c78bcaa2-754f-4a7f-9e89-f5a6e42d7594">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗавершенныеРемонтныеРаботы/торо_ЗавершенныеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗавершенныеРемонтныеРаботы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ID</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_АктОВыполненииЭтапаРабот/торо_АктОВыполненииЭтапаРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктОВыполненииЭтапаРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЗавершитьРемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f78c6d7a-513d-4172-acd6-67cd539553be">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c6ebc082-5b34-4dc9-989e-5ceca388a781">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="93edf17a-e6e1-43b7-b637-bb7683198138">
    <name>РемонтныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c026f7f3-9001-48e8-ae43-b6311afc572a">
      <name>Родитель_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="13c5222c-e72c-4deb-976b-ea5e71c2a76c">
      <name>РемонтыОборудования_ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="5b155dad-268f-40a5-9cda-adf38b849861">
      <name>РемонтнаяРабота</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="292545f4-3656-4274-98e7-6524e7005040">
      <name>НоваяОперация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a1e00ed1-d007-48a1-a97c-9c09cb1af366">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bce66135-2c2d-4b02-9b24-1b4b257fc415">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="6e222db4-48e2-41e6-b0db-be541d07402b">
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="783b72be-3d92-47e1-83c1-f83e5d116bfb">
      <name>гкс_Давальческие</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="305c47b2-824e-4796-a135-d4962b2f23d3">
    <name>ИсполнителиПоРемонтам</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаЖурналаДефектов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура Расш_гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [8078] Тарасов 09.10.2020
	ДобавитьИзменитьЭлементы();
	// гкс- [8078] Тарасов 09.10.2020
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокДефектов")
Функция Расш_гкс_ПолучитьСписокДефектов()

	ТабДок=Результат;
	ТабДок.Очистить();
	#Вставка
	СдвигЧП = Час(ТекущаяДатаСеанса()) - Час(ТекущаяДата());
	#КонецВставки

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ЖурналДефектов");
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_дс_ЖурналДефектов");
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);

	// Отбор
	ВывестиОбласть = Ложь;
	Область = Макет.ПолучитьОбласть("Отбор");
	Если ЗначениеЗаполнено(Организация) Тогда
		ВывестиОбласть					= Истина;
		Область.Параметры.Организация	= Организация;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ВывестиОбласть								= Истина;
		Область.Параметры.ПодразделениеОрганизации	= ПодразделениеОрганизации;
	КонецЕсли;

	Если ЗначениеЗаполнено(ОР) Тогда
		ВывестиОбласть			= Истина;
		Область.Параметры.ОР	= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
	КонецЕсли;

	Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
		ВывестиОбласть			= Истина;
		// >> [Деснол] [Ушаков А.Д.] [04.10.2019] 
		Область.Параметры.Дата = СтрШаблон(НСтр("es='Período: %1: %2';ru='Период с: %1 по: %2';en='The period from: %1 to: %2'"), НачПериода, КонПериода);
		//Область.Параметры.Дата	= "Период с: " + НачПериода + " по: " + КонПериода;
		// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	КонецЕсли;
	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда 
			ВывестиОбласть			= Истина;
			Область.Параметры.гкс_СтатусСогласования = ЭтаФорма["гкс_СтатусСогласования"];
		КонецЕсли;
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	
	#КонецВставки
	Если ВывестиОбласть Тогда
		ТабДок.Вывести(Область);
	КонецЕсли;

	СписокДефектов = Новый Запрос();		

	СписокДефектов.Текст ="ВЫБРАТЬ
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ЕСТЬNULL(торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, 
	|				ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка)) КАК гкс_СтатусСогласования,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка КАК Документ,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	торо_ВыявленныеДефектыСписокДефектов.ID,
	|	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
	|	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
	|	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина,
	|	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта,
	|	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный,
	|	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение
	|ПОМЕСТИТЬ ВТДефекты
	|ИЗ
	|	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов КАК торо_ТекущиеСтатусыСогласованияДокументов
	|		ПО торо_ВыявленныеДефектыСписокДефектов.Ссылка = торо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Организация = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация = &Организация
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОбъектРемонта = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА &ОбъектРемонтаРодитель = НЕОПРЕДЕЛЕНО
	|						ТОГДА торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта
	|					ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В ИЕРАРХИИ (&ОбъектРемонтаРодитель)
	|				КОНЕЦ
	|		КОНЕЦ
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	И ВЫБОР
	|			КОГДА &гкс_ОтказавшийЭлемент = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент = &гкс_ОтказавшийЭлемент
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &гкс_СтатусСогласования = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(торо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента, 
	|					ЗНАЧЕНИЕ(Справочник.торо_СтатусыСогласованияДокументовРемонтныхРабот.ПустаяСсылка)) = &гкс_СтатусСогласования
	|		КОНЕЦ
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	И ВЫБОР
	|			КОГДА &Подразделение = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НачПериода = ""НЕОПРЕДЕЛЕНО""
	|					ИЛИ &КонПериода = ""НЕОПРЕДЕЛЕНО""
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения МЕЖДУ &НачПериода И &КонПериода
	|		КОНЕЦ
	|	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_Ремонты.Регистратор,
	|	торо_Ремонты.ID
	|ПОМЕСТИТЬ ВТРСРемонты
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|ГДЕ
	|	торо_Ремонты.ID В
	|			(ВЫБРАТЬ
	|				ВТДефекты.ID
	|			ИЗ
	|				ВТДефекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Удаление
	|	ВТРСРемонты.Регистратор,
	#КонецУдаления
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ЕСТЬNULL(ВТРСРемонты.Регистратор, ВТДефекты.Документ) КАК Регистратор,
	|	ВТДефекты.гкс_СтатусСогласования КАК гкс_СтатусСогласования,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	ВТДефекты.ОбъектРемонта КАК ОбъектРемонта,
	|	ВТДефекты.ОтказавшийЭлемент,
	|	ВТДефекты.ДефектОписание,
	|	ВТДефекты.ДефектПричина,
	|	ВТДефекты.ВидДефекта,
	|	ВТДефекты.ПоследствияДефекта,
	|	ВТДефекты.НаправлениеНаУстранение,
	|	ВТДефекты.ID,
	|	ВТДефекты.Подразделение,
	|	ВТДефекты.Ответственный,
	|	ВТДефекты.ДатаОбнаружения,
	|	ВТДефекты.Организация
	|ПОМЕСТИТЬ ВТДефектыОборудования
	|ИЗ
	|	ВТДефекты КАК ВТДефекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
	|		ПО ВТДефекты.ID = ВТРСРемонты.ID
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТДефектыОборудования.Регистратор,
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	|	ВТДефектыОборудования.гкс_СтатусСогласования КАК гкс_СтатусСогласования,
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	|	ВТДефектыОборудования.ОбъектРемонта,
	|	ВТДефектыОборудования.ОтказавшийЭлемент,
	|	ВТДефектыОборудования.ДефектОписание,
	|	ВТДефектыОборудования.ДефектПричина,
	|	ВТДефектыОборудования.ВидДефекта,
	|	ВТДефектыОборудования.ПоследствияДефекта,
	|	ВТДефектыОборудования.НаправлениеНаУстранение,
	|	ВТДефектыОборудования.ID,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА isnull(ВТРСРемонты.Регистратор,ВТДефектыОборудования.Регистратор)
	|		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор
	|	КОНЕЦ КАК Регистратор1,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ""Не устранен""
	|		ИНАЧЕ ""Устранен""
	|	КОНЕЦ КАК Устранен,
	|	ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
	|						ТОГДА ""Зарегистрирован""
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|								ТОГДА ""Работы не начаты""
	|							ИНАЧЕ ""Работы начаты""
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ ""Работы завершены""
	|	КОНЕЦ КАК СостояниеРабот,
	|ВЫБОР
	|		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|				КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|						ТОГДА 2
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|			КОНЕЦ
	|		ИНАЧЕ 1
	|КОНЕЦ КАК СтатусСортировки,
	|	ВТДефектыОборудования.ДатаОбнаружения,
	|	ВТДефектыОборудования.Ответственный
	|ИЗ
	|	ВТДефектыОборудования КАК ВТДефектыОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
	|		ПО ВТДефектыОборудования.ID = торо_ЗавершенныеРемонтныеРаботы.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
	|		ПО ВТДефектыОборудования.ID = ВТРСРемонты.ID
	|			И (ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТДефектыОборудования.ДатаОбнаружения,
	|	СтатусСортировки УБЫВ
	|ИТОГИ ПО
	|	ВТДефектыОборудования.ID";

	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ТекстЗапроса = СписокДефектов.Текст;

	Переводы = Новый Соответствие;

	Переводы.Вставить("_РаботыЗавершены", НСтр("es='El trabajo se haya completado';ru='Работы завершены';en='Work completed'"));
	Переводы.Вставить("_Зарегистрирован", НСтр("es='Registrado';ru='Зарегистрирован';en='Registered'"));
	Переводы.Вставить("_НеУстранен", НСтр("es='No eliminado';ru='Не устранен';en='Not eliminated'"));
	Переводы.Вставить("_Устранен", НСтр("es='Eliminado';ru='Устранен';en='Fixed'"));
	Переводы.Вставить("_РаботыНеНачаты", НСтр("es='El trabajo no se desarrollan';ru='Работы не начаты';en='Work is not started'"));
	Переводы.Вставить("_РаботыНачаты", НСтр("es='El trabajo iniciado';ru='Работы начаты';en='Work started'"));

	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""Работы завершены""", "&_РаботыЗавершены");
	СтрокиЗамены.Вставить("""Зарегистрирован""", "&_Зарегистрирован");
	СтрокиЗамены.Вставить("""Не устранен""", "&_НеУстранен");
	СтрокиЗамены.Вставить("""Устранен""", "&_Устранен");
	СтрокиЗамены.Вставить("""Работы не начаты""", "&_РаботыНеНачаты");
	СтрокиЗамены.Вставить("""Работы начаты""", "&_РаботыНачаты");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен", 
													"И НЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ПометкаУдаления");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ
										|	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)",
										"		И ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)");
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	
	#КонецВставки	
	СписокДефектов.Текст = ТекстЗапроса;

	Для каждого Перевод Из Переводы Цикл
		СписокДефектов.УстановитьПараметр(Перевод.Ключ, Перевод.Значение);
	КонецЦикла;
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

	// СписокДефектов
	Область = Макет.ПолучитьОбласть("СписокДефектовШапка");
	ТабДок.Вывести(Область);
	ОбластьСписокДефектов = Макет.ПолучитьОбласть("СписокДефектов");

	// Если поле "Организация" заполнено, то в запросе отбор по ней
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокДефектов.УстановитьПараметр("Организация", Организация);
	Иначе
		СписокДефектов.УстановитьПараметр("Организация", Неопределено);
	КонецЕсли;

	// Если поле "Подразделение" заполнено, то в запросе отбор по нему
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		СписокДефектов.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
	Иначе
		СписокДефектов.УстановитьПараметр("Подразделение", Неопределено);
	КонецЕсли;	

	// Если поле "ОР" заполнено, то в запросе отбор по нему
	СписокОРДляОтбора = Новый СписокЗначений;
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	Если ЭтаФорма["гкс_ОРОтказавшийЭлемент"] Тогда
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", 			Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", 	Неопределено);
		СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", 	Неопределено);
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", ОР);
		КонецЕсли;
		
		СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", Неопределено);
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда
			СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", ЭтаФорма["гкс_СтатусСогласования"]);
		КонецЕсли;
		
	Иначе
		// гкс+ [10.22] Деснол 11.10.2022
		СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", 	Неопределено);
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("гкс_ОтказавшийЭлемент", ОР);
		КонецЕсли;
		СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", Неопределено);
		Если ЗначениеЗаполнено(ЭтаФорма["гкс_СтатусСогласования"]) Тогда
			СписокДефектов.УстановитьПараметр("гкс_СтатусСогласования", ЭтаФорма["гкс_СтатусСогласования"]);
		КонецЕсли;
		// гкс- [10.22] Деснол 11.10.2022
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	Если ЗначениеЗаполнено(ОР) Тогда
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", ОР);	
	Иначе
		СписокДефектов.УстановитьПараметр("ОбъектРемонта", Неопределено);
		СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
	КонецЕсли;	
	#Вставка
	// гкс+ [8078] Тарасов 09.10.2020
	КонецЕсли;
	// гкс- [8078] Тарасов 09.10.2020
	#КонецВставки
	
	// Если поля "Даты" заполнено, то в запросе отбор по ним
	Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
		СписокДефектов.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
		СписокДефектов.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Иначе
		СписокДефектов.УстановитьПараметр("НачПериода", "НЕОПРЕДЕЛЕНО");
		СписокДефектов.УстановитьПараметр("КонПериода", "НЕОПРЕДЕЛЕНО");
	КонецЕсли;		

	ДефектыВыборка		 = СписокДефектов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ДефектыВыборка.Следующий() Цикл 

		Выборка = ДефектыВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если Выборка.Следующий() Тогда
			ОбластьСписокДефектов.Параметры.Заполнить(Выборка);
			ОбластьСписокДефектов.Параметры.ОбъектРемонтаПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
			ОбластьСписокДефектов.Параметры.ОтказавшийЭлементПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОтказавшийЭлемент);
			#Вставка
			ОбластьСписокДефектов.Параметры.ДатаОбнаружения = ОбластьСписокДефектов.Параметры.ДатаОбнаружения 
				+ (СдвигЧП * 3600);
			#КонецВставки
			ТабДок.Вывести(ОбластьСписокДефектов);
		КонецЕсли;

	КонецЦикла;

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	// Зададим параметры макета
	ТабДок.ПолеСверху         = 0;
	ТабДок.ПолеСлева          = 0;
	ТабДок.ПолеСнизу          = 0;
	ТабДок.ПолеСправа         = 0;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб  = ИСТИНА;

	Возврат ТабДок;

КонецФункции

// гкс+ [8078] Тарасов 09.10.2020
&НаСервере
Процедура ДобавитьИзменитьЭлементы()

	НовыеРеквизиты = Новый Массив();
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_ОРОтказавшийЭлемент", Новый ОписаниеТипов("Булево")));
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("гкс_СтатусСогласования", 
														Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		Если Параметры.ПараметрыОтбора.Свойство("гкс_ОРОтказавшийЭлемент", ЭтаФорма["гкс_ОРОтказавшийЭлемент"]) Тогда
			Элементы.ОР.Заголовок = НСтр("ru='Отказавший элемент';en='Failed item';es='El elemento que ha renunciado'");
			
			НЭлем = Элементы.Вставить("гкс_СтатусСогласования",Тип("ПолеФормы"), ЭтаФорма, Элементы.ОР);
			НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			НЭлем.ПутьКДанным = "гкс_СтатусСогласования";
			НЭлем.Заголовок = НСтр("ru='Статус cогласования';en='Approval status';es='Estado de aprobación'");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // гкс- [8078] Тарасов 09.10.2020

#КонецОбласти
